// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.

//Создает числовую матрицу 
int[,,] Array3D(int rows, int colums, int lenght)
{
    int[,,] array = new int[rows, colums, lenght];
    int num = 10;
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = 0; k < array.GetLength(2); k++)
            {
                array[i, j, k] = num++;
            }
        }
    }
    return array;
}

void PrintArray(int[,,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = 0; k < array.GetLength(2); k++)
            {
                Console.WriteLine($"({i}, {j}, {k}) = {array[i, j, k]}");
            }
        }
    }
}

int[,,] array = Array3D(4, 4, 4);
PrintArray(array);




